<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Import-pandas-and-load-the-two-NLS-DataFrames" data-toc-modified-id="Import-pandas-and-load-the-two-NLS-DataFrames-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Import pandas and load the two NLS DataFrames</a></span></li><li><span><a href="#Check-that-the-number-of-unique-values-for-originalid-is-equal-to-the-number-of-rows" data-toc-modified-id="Check-that-the-number-of-unique-values-for-originalid-is-equal-to-the-number-of-rows-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Check that the number of unique values for originalid is equal to the number of rows</a></span></li><li><span><a href="#Create-some-mismatched-IDs" data-toc-modified-id="Create-some-mismatched-IDs-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Create some mismatched IDs</a></span></li><li><span><a href="#Use-join-to-perform-a-left-join" data-toc-modified-id="Use-join-to-perform-a-left-join-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Use join to perform a left join</a></span></li><li><span><a href="#Perform-a-left-join-with-merge" data-toc-modified-id="Perform-a-left-join-with-merge-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Perform a left join with merge</a></span></li><li><span><a href="#Perform-a-right-join" data-toc-modified-id="Perform-a-right-join-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Perform a right join</a></span></li><li><span><a href="#Perform-an-inner-join" data-toc-modified-id="Perform-an-inner-join-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Perform an inner join</a></span></li><li><span><a href="#Perform-an-outer-join" data-toc-modified-id="Perform-an-outer-join-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Perform an outer join</a></span></li><li><span><a href="#Create-a-function-to-check-for-ID-mismatches" data-toc-modified-id="Create-a-function-to-check-for-ID-mismatches-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Create a function to check for ID mismatches</a></span></li></ul></div>

# Import pandas and load the two NLS DataFrames

In [1]:
import pandas as pd

In [2]:
# pd.set_option('display.width', 80)
# pd.set_option('display.max_columns', 7)
# pd.set_option('display.max_rows', 100)
# pd.options.display.float_format = '{:,.0f}'.format

In [3]:
import watermark
%load_ext watermark

%watermark -n -i -iv

json     : 2.0.9
watermark: 2.1.0
pandas   : 1.2.1

In [4]:
nls97 = pd.read_csv('data/nls97f.csv')
nls97.set_index('personid', inplace=True)

In [5]:
nls97add = pd.read_csv('data/nls97add.csv')

In [6]:
nls97.head()

,gender,birthmonth,birthyear,highestgradecompleted,maritalstatus,childathome,childnotathome,wageincome,weeklyhrscomputer,weeklyhrstv,...,colenroct13,colenrfeb14,colenroct14,colenrfeb15,colenroct15,colenrfeb16,colenroct16,colenrfeb17,colenroct17,originalid
personid,,,,,,,,,,,,,,,,,,,,,
100061,Female,5,1980,13.0,Married,4.0,0.0,12500.0,10 hours or more a week,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,8245
100139,Male,9,1983,12.0,Married,2.0,0.0,120000.0,1 to 3 hours a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,3962
100284,Male,11,1984,7.0,Never-married,1.0,0.0,58000.0,None,11 to 20 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,3571
100292,Male,4,1982,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,NaN,NaN,NaN,NaN,2979
100583,Male,1,1980,13.0,Married,4.0,0.0,30000.0,Less than 1 hour a week,3 to 10 hours a week,...,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,1. Not enrolled,8511

In [7]:
nls97.shape

(8984, 89)

In [8]:
nls97add.head()

   originalid  motherage  parentincome  fatherhighgrade  motherhighgrade
0           1         26            -3               16                8
1           2         19            -4               17               15
2           3         26         63000               -3               12
3           4         33         11700               12               12
4           5         34            -3               12               12

In [9]:
nls97add.shape

(8984, 5)

# Check that the number of unique values for originalid is equal to the number of rows

We will use originalid for our merge-by column later

In [10]:
nls97['originalid'].nunique() == nls97.shape[0]

True

In [11]:
nls97add['originalid'].nunique() == nls97add.shape[0]

True

# Create some mismatched IDs

In [12]:
nls97 = nls97.sort_values('originalid')
nls97add = nls97add.sort_values('originalid')

In [13]:
nls97.iloc[0:2, -1]

personid
135335    1
999406    2
Name: originalid, dtype: int64

In [14]:
nls97.iloc[0:2, -1] = nls97.iloc[0:2, -1] + 10000

In [15]:
nls97.iloc[0:2, -1]

personid
135335    10001
999406    10002
Name: originalid, dtype: int64

In [16]:
nls97['originalid'].head(2)

personid
135335    10001
999406    10002
Name: originalid, dtype: int64

In [17]:
nls97add.iloc[0:2, 0] = nls97add.iloc[0:2, 0] + 20000

In [18]:
nls97add['originalid'].head(2)

0    20001
1    20002
Name: originalid, dtype: int64

# Use join to perform a left join

In [19]:
nlsnew = nls97.join(nls97add.set_index(['originalid']))

In [20]:
nlsnew.loc[nlsnew['originalid'] > 9999,
           ['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]

          originalid  gender  birthyear  motherage  parentincome
personid
135335         10001  Female       1981        NaN           NaN
999406         10002    Male       1982        NaN           NaN

# Perform a left join with merge

In [21]:
nlsnew1 = pd.merge(nls97, nls97add, on=['originalid'], how='left')

In [22]:
nlsnew1.loc[nlsnew1['originalid'] > 9999,
            ['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]

   originalid  gender  birthyear  motherage  parentincome
0       10001  Female       1981        NaN           NaN
1       10002    Male       1982        NaN           NaN

# Perform a right join

In [23]:
nlsnew2 = pd.merge(nls97, nls97add, on=['originalid'], how='right')

In [24]:
nlsnew2.loc[nlsnew2['originalid'] > 9999,
            ['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]

   originalid gender  birthyear  motherage  parentincome
0       20001    NaN        NaN         26            -3
1       20002    NaN        NaN         19            -4

# Perform an inner join

In [25]:
nlsnew3 = pd.merge(nls97, nls97add, on=['originalid'], how='inner')

In [26]:
nlsnew3.loc[nlsnew3['originalid'] > 9999,
            ['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]

Empty DataFrame
Columns: [originalid, gender, birthyear, motherage, parentincome]
Index: []

# Perform an outer join

In [27]:
nlsnew4 = pd.merge(nls97, nls97add, on=['originalid'], how='outer')

In [28]:
nlsnew4.loc[nlsnew4['originalid'] > 9999,
            ['originalid', 'gender', 'birthyear', 'motherage', 'parentincome']]

      originalid  gender  birthyear  motherage  parentincome
0          10001  Female     1981.0        NaN           NaN
1          10002    Male     1982.0        NaN           NaN
8984       20001     NaN        NaN       26.0          -3.0
8985       20002     NaN        NaN       19.0          -4.0

# Create a function to check for ID mismatches

In [29]:
def checkmerge(dfleft, dfright, idvar):
    dfleft['inleft'] = 'Y'
    dfright['inright'] = 'Y'
    dfboth = pd.merge(dfleft[[idvar, 'inleft']],
                      dfright[[idvar, 'inright']],
                      on=[idvar],
                      how='outer')
    dfboth.fillna('N', inplace=True)
    print(pd.crosstab(dfboth['inleft'], dfboth['inright']))

In [30]:
checkmerge(nls97, nls97add, 'originalid')

inright  N     Y
inleft
N        0     2
Y        2  8982